[
    {
      "imgUrl": "/images/wild-oasis.png",
      "name": "The Wild Oasis",
      "demo": "https://the-wild-oasis-six-ruddy.vercel.app/",
      "git": "https://github.com/estefaniaderosa/the-wild-oasis",
      "enDescription": "An interactive hotel page simulation where users can easily sign up or log in using their Google account through Auth.js. The app allows users to make, edit, and cancel reservations as needed. It’s connected to a Supabase database, ensuring each reservation is stored and managed in real time. Developed in Next.js with a modern, responsive design using Tailwind CSS, this platform provides a smooth and engaging user experience for managing reservations intuitively and efficiently. Deployed on Vercel.",
      "esDescription": "App que simula la página de un hotel donde los usuarios pueden registrarse o iniciar sesión fácilmente con su cuenta de Google gracias a Auth.js. La app permite realizar reservas, así como editarlas o cancelarlas según sus necesidades. Todo está conectado a una base de datos en Supabase, asegurando que cada reserva se almacene y gestione en tiempo real. Desarrollada en Next.js con un diseño moderno y receptivo usando Tailwind CSS, esta plataforma ofrece una experiencia de usuario fluida y atractiva para gestionar reservas de manera intuitiva y eficiente.",
      "tags": "#NextJS  #AuthJS  #Supabase  #TailwindCSS  #ContextAPI"
    },
    {
      "imgUrl": "/images/portfolio.png",
      "name": "NUWE SCL Frontend",
      "demo": "https://estefaniaderosa.github.io/nuwescl1/",
      "git": "https://github.com/estefaniaderosa/nuwescl1",
      "enDescription": "Winner project of the first week for the Nuwe.io Summer Coding League Frontend challenge: Nuwe Basic Profile.",
      "esDescription": "Solución al primer reto Frontend de la Summer Coding League de NUWE, en el que he obtenido el 1er puesto en el ranking.",
      "tags": "#React   #Redux   #Hooks   #UnsplashAPI   #Responsive   #Flexbox"
    },
    {
      "imgUrl": "/images/gbhotel.png",
      "name": "Grand Beach Hotel",
      "demo": "https://estefaniaderosa.github.io/gbhotel/",
      "git": "https://github.com/estefaniaderosa/gbhotel",
      "enDescription": "Responsive fictional hotel App. You can subscribe to the newsletter, book different rooms & tours and read reviews! This app was built in React using Hooks and React Router for navigation. Check out the CSS animations in avatars, flipping cards and effected buttons.",
      "esDescription": "App Responsive de hotel ficticio. Puedes subscribirte al newsletter, reservar diferentes tipos de habitaciones, tours y leer reviews. App desarollada en React usando Hooks y React Router para la navegación. Hecha un vistazo a las animaciones CSS en las tarjetas rotativas, avatares y botones!",
      "tags": "#React   #Hooks   #React-Router   #CSS    #Flexbox #Responsive"
    },
    {
      "imgUrl": "/images/todo.png",
      "name": "What's the plan for today?",
      "demo": "https://estefaniaderosa.github.io/planner/",
      "git": "https://github.com/estefaniaderosa/planner",
      "enDescription": "Interactive To Do List to keep your daily tasks organized. You can edit each task, mark them as completed or delete them. Everytime a task is added or deleted on the list, the colour of the previous tasks will change. This app was built in React using Hooks and Local Storage.",
      "esDescription": "Lista interactiva para mantener organizadas las tareas diarias.Puedes editar cada tarea, marcarlas como completas o eliminarlas. Cada vez que se agrega o se borra una tarea, el color de las tareas previas en la lista cambiará. Esta app fue desarrollada en React usando Hooks y Local Storage.",
      "tags": "#React   #Hooks   #Responsive  #CSS   #Local Storage "
    },
    {
      "imgUrl": "/images/flappyghost.png",
      "name": "FlappyGhost",
      "demo": "https://estefaniaderosa.github.io/flappyghost",
      "git": "https://github.com/estefaniaderosa/flappyghost",
      "enDescription": "Try to keep this cute ghost away from the pipes and the ground! Everytime Ghosty pass through a pair of pipes successfully you get one point. This arcade-style game is inspired in FlappyBird and fully developed in Vanilla Javascript.",
      "esDescription": "Evita que este adorable fantasmita se estrelle con las tuberias o el piso. Cada vez que Ghosty pasa por un par de tuberias exitosamente, obtienes un punto. Este juego esta inspirado en FlappyBird y completamente desarrollado en JavaScript nativo.",
      "tags": "#JavaScript   #Vanilla   #CSS"
    },
    {
      "imgUrl": "/images/pokedex.png",
      "name": "Pokedex",
      "demo": "https://estefaniaderosa.github.io/pokedex",
      "git": "https://github.com/estefaniaderosa/pokedex",
      "enDescription": "An app that fetches data from the Pokemon API and displays information about the first 151 Pokemon. Write the name of your favourite Pokemon and get to know it’s type, main-move, and main-ability. This app was developed in React using Hooks, Axios and Semantic UI.",
      "esDescription": "App que consume datos de la API de Pokemon y muestra información sobre los primeros 151 Pokemon. Escribe el nombre de tu Pokemon favorito y conoce su tipo, movimiento y habilidad principal. Esta app ha sido desarrollada en React usando Hooks, Axios y Semantic UI.",
      "tags": "#React   #Hooks  #CSS   #PokeAPI   #Axios   #SemanticUI"
    }
  ]
  